# General-purpose data compression with high compression ratio
brew "xz"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Yet Another Java Decompiler
brew "cfr-decompiler"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# AI coding agent, built for the terminal
brew "opencode"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@17"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Utility that provides fast incremental file transfer
brew "rsync"
# Display and control your Android device
brew "scrcpy"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Open source continuous file synchronization application
brew "syncthing"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Binary diff, differential compression tools
brew "xdelta"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Android SDK component
cask "android-platform-tools"
# OpenAI's coding agent that runs in your terminal
cask "codex"
cask "font-hack-nerd-font"
cask "font-pretendard"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# OpenJDK distribution from Azul
cask "zulu@17"
# OpenJDK distribution from Azul
cask "zulu@21"