tap "grishka/grishka"
brew "xz"
brew "bash"
brew "bat"
brew "bat-extras"
brew "chezmoi"
brew "cmake"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-delta"
brew "gradle"
brew "ktlint"
brew "mas"
brew "maven"
brew "mise"
brew "pkgconf"
brew "postgresql@17"
brew "python@3.13"
brew "ripgrep"
brew "ripgrep-all"
brew "rsync"
brew "syncthing"
brew "uv"
brew "vivid"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "font-hack-nerd-font"
cask "font-pretendard"
cask "miniforge"
cask "neardrop"
cask "zulu@17"
cask "zulu@21"